# IFC_DMLoadSettings

## Description
Loads the indicated IFC Data Mapping.

```pascal
FUNCTION IFC_DMLoadSettings(inStrParam : STRING) : BOOLEAN;
```

```python

def vs.IFC_DMLoadSettings(inStrParam):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrParam|STRING||

## Version
Availability: from Vectorworks 2017
## Category
* IFC